{
    "paper_id": "2502.16023v1",
    "paper_key": "2502.16023",
    "title": "Contrastive Similarity Learning for Market Forecasting: The ContraSim Framework",
    "url": "http://arxiv.org/abs/2502.16023",
    "pdf_url": "/Users/wenkeli/work/LLMQuant/quant-scholar/papers/2025-03/Machine Learning in Finance/2502.16023.pdf",
    "abstract": "We introduce the Contrastive Similarity Space Embedding Algorithm (ContraSim), a novel framework for uncovering the global semantic relationships between daily financial headlines and market movements. ContraSim operates in two key stages: (I) Weighted Headline Augmentation, which generates augmented financial headlines along with a semantic fine-grained similarity score, and (II) Weighted Self-Supervised Contrastive Learning (WSSCL), an extended version of classical self-supervised contrastive learning that uses the similarity metric to create a refined weighted embedding space. This embedding space clusters semantically similar headlines together, facilitating deeper market insights. Empirical results demonstrate that integrating ContraSim features into financial forecasting tasks improves classification accuracy from WSJ headlines by 7%. Moreover, leveraging an information density analysis, we find that the similarity spaces constructed by ContraSim intrinsically cluster days with homogeneous market movement directions, indicating that ContraSim captures market dynamics independent of ground truth labels. Additionally, ContraSim enables the identification of historical news days that closely resemble the headlines of the current day, providing analysts with actionable insights to predict market trends by referencing analogous past events.",
    "authors": "Nicholas Vinden, Raeid Saqur, Zining Zhu, Frank Rudzicz",
    "first_author": "Nicholas Vinden, Raeid Saqur, Zining Zhu",
    "primary_category": "q-fin.ST",
    "publish_time": "2025-02-22",
    "update_time": "2025-02-22",
    "comments": "8 pages, 3 appendices",
    "code_url": "https://arxiv.paperswithcode.com/api/v0/papers/2502.16023v1"
}