{
    "paper_id": "2502.17044v1",
    "paper_key": "2502.17044",
    "title": "A data-driven econo-financial stress-testing framework to estimate the effect of supply chain networks on financial systemic risk",
    "url": "http://arxiv.org/abs/2502.17044",
    "pdf_url": "/Users/wenkeli/work/LLMQuant/quant-scholar/papers/2025-03/Machine Learning in Finance/2502.17044.pdf",
    "abstract": "Supply chain disruptions constitute an often underestimated risk for financial stability. As in financial networks, systemic risks in production networks arises when the local failure of one firm impacts the production of others and might trigger cascading disruptions that affect significant parts of the economy. Here, we study how systemic risk in production networks translates into financial systemic risk through a mechanism where supply chain contagion leads to correlated bank-firm loan defaults. We propose a financial stress-testing framework for micro- and macro-prudential applications that features a national firm level supply chain network in combination with interbank network layers. The model is calibrated by using a unique data set including about 1 million firm-level supply links, practically all bank-firm loans, and all interbank loans in a small European economy. As a showcase we implement a real COVID-19 shock scenario on the firm level. This model allows us to study how the disruption dynamics in the real economy can lead to interbank solvency contagion dynamics. We estimate to what extent this amplifies financial systemic risk. We discuss the relative importance of these contagion channels and find an increase of interbank contagion by 70% when production network contagion is present. We then examine the financial systemic risk firms bring to banks and find an increase of up to 28% in the presence of the interbank contagion channel. This framework is the first financial systemic risk model to take agent-level dynamics of the production network and shocks of the real economy into account which opens a path for directly, and event-driven understanding of the dynamical interaction between the real economy and financial systems.",
    "authors": "Jan Fialkowski, Christian Diem, András Borsos, Stefan Thurner",
    "first_author": "Jan Fialkowski, Christian Diem, András Borsos",
    "primary_category": "q-fin.ST",
    "publish_time": "2025-02-24",
    "update_time": "2025-02-24",
    "comments": "",
    "code_url": "https://arxiv.paperswithcode.com/api/v0/papers/2502.17044v1"
}