{
    "paper_id": "2502.19305v1",
    "paper_key": "2502.19305",
    "title": "Corporate Fraud Detection in Rich-yet-Noisy Financial Graph",
    "url": "http://arxiv.org/abs/2502.19305",
    "pdf_url": "/Users/wenkeli/work/LLMQuant/quant-scholar/papers/2025-03/Machine Learning in Finance/2502.19305.pdf",
    "abstract": "Corporate fraud detection aims to automatically recognize companies that conduct wrongful activities such as fraudulent financial statements or illegal insider trading. Previous learning-based methods fail to effectively integrate rich interactions in the company network. To close this gap, we collect 18-year financial records in China to form three graph datasets with fraud labels. We analyze the characteristics of the financial graphs, highlighting two pronounced issues: (1) information overload: the dominance of (noisy) non-company nodes over company nodes hinders the message-passing process in Graph Convolution Networks (GCN); and (2) hidden fraud: there exists a large percentage of possible undetected violations in the collected data. The hidden fraud problem will introduce noisy labels in the training dataset and compromise fraud detection results. To handle such challenges, we propose a novel graph-based method, namely, Knowledge-enhanced GCN with Robust Two-stage Learning (${\\rm KeGCN}_{R}$), which leverages Knowledge Graph Embeddings to mitigate the information overload and effectively learns rich representations. The proposed model adopts a two-stage learning method to enhance robustness against hidden frauds. Extensive experimental results not only confirm the importance of interactions but also show the superiority of ${\\rm KeGCN}_{R}$ over a number of strong baselines in terms of fraud detection effectiveness and robustness.",
    "authors": "Shiqi Wang, Zhibo Zhang, Libing Fang, Cam-Tu Nguyen, Wenzhon Li",
    "first_author": "Shiqi Wang, Zhibo Zhang, Libing Fang",
    "primary_category": "cs.LG",
    "publish_time": "2025-02-26",
    "update_time": "2025-02-26",
    "comments": "",
    "code_url": "https://arxiv.paperswithcode.com/api/v0/papers/2502.19305v1"
}